{
   "status":"ok",
   "totalResults":14460,
   "articles":[
      {
         "source":{
            "id":null,
            "name":"BeInCrypto"
         },
         "author":"Luis Blanco",
         "title":"Usuario de Bitcoin (BTC) gasta más de $100,000 en comisiones por una transacción: ¿Se trata de un error?",
         "description":"Un hecho insólito ha conmocionado a la comunidad Bitcoin: un usuario anónimo realizó una transferencia de 1.59 BTC (equivalentes a aproximadamente 102,120 dólares) y, para su sorpresa, el receptor solo recibió ¡6 dólares! La razón: casi la totalidad de los fo…",
         "url":"https://es.beincrypto.com/usuario-bitcoin-gasta-mas-100000-comisiones/",
         "urlToImage":"https://s32679.pcdn.co/wp-content/uploads/2022/12/BIC_recession_depression_cover.jpg.webp",
         "publishedAt":"2024-05-04T13:01:16Z",
         "content":"Un hecho insólito ha conmocionado a la comunidad Bitcoin: un usuario anónimo realizó una transferencia de 1.59 BTC (equivalentes a aproximadamente 102,120 dólares) y, para su sorpresa, el destinatari… [+2493 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Ambcrypto.com"
         },
         "author":"Abiodun Oladokun",
         "title":"Bitcoin’s road to $65,000 – Here’s what needs to happen for that price target",
         "description":"Bitcoin might have its next price level in sight. However, a few things need to pan out before that.",
         "url":"https://ambcrypto.com/bitcoins-road-to-65000-heres-what-needs-to-happen-for-that-price-target/",
         "urlToImage":"https://ambcrypto.com/wp-content/uploads/2024/05/Bitcoin-2-1000x600.png",
         "publishedAt":"2024-05-04T13:00:51Z",
         "content":"<ul><li>Bitcoins price has risen by over 6% in 24 hours</li><li>If the bulls hold on to market control, a rally past $65,000 might be possible</li></ul>According to Santiment, the 6% hike in Bitcoins… [+2636 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"youtube.com",
         "title":"Crypto Bull Market Analysis: Bitcoin, Altcoins, Memecoins, RWA Tokenization & Developer Activity",
         "description":"Brian from Santiment joins me to discuss various crypto metrics. We touch on Bitcoin, ETFs, Memecoins, Altcoins, RAW tokenization blockchains and more.️ Sign up with Santiment to get quality crypto metrics - https://santiment.net/?fpr=thinkingcrypto Get 25%…",
         "url":"https://biztoc.com/x/6fac6828edaf06e4",
         "urlToImage":"https://c.biztoc.com/p/6fac6828edaf06e4/s.webp",
         "publishedAt":"2024-05-04T13:00:05Z",
         "content":"Brian from Santiment joins me to discuss various crypto metrics. We touch on Bitcoin, ETFs, Memecoins, Altcoins, RAW tokenization blockchains and more. Sign up with Santiment to get quality crypto me… [+277 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Quartz India"
         },
         "author":"Quartz Bot",
         "title":"Apple spikes, Bitcoin sinks, and stocks swing with the Fed: Markets news roundup",
         "description":"The Dow Jones Industrial Average and other U.S. stock indexes spiked Wednesday afternoon — not because the Federal Reserve left interest rates unchanged, but because there won’t be any more rate hikes. The market started celebrating after the Fed Chair Jerome…",
         "url":"https://qz.com/apple-stock-buyback-bitcoin-price-fed-interest-rates-1851454642",
         "urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/e5918bffe0fd7f8ab32ddf25cbdfe9c0.jpg",
         "publishedAt":"2024-05-04T13:00:00Z",
         "content":"If you receive Supplemental Security Income, youre getting two checks next month thanks a scheduling quirk.\r\nNormally, SSI payments go out on the first of every month. But since June 1 is on a Saturd… [+208 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"bitcoinnews.com",
         "title":"Block Co-Founder Jack Dorsey Eyes Smart Bitcoin Investment",
         "description":"Co-founder of Block Jack Dorsey, recently announced that his firm is upping its game by introducing plans to invest a chunk of its bitcoin profits back into the digital currency. This strategic move, unveiled alongside a lifted profit forecast for the year, d…",
         "url":"https://biztoc.com/x/ae6115692986e96f",
         "urlToImage":"https://c.biztoc.com/p/ae6115692986e96f/s.webp",
         "publishedAt":"2024-05-04T12:52:10Z",
         "content":"Co-founder of Block Jack Dorsey, recently announced that his firm is upping its game by introducing plans to invest a chunk of its bitcoin profits back into the digital currency. This strategic move,… [+282 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"bitcoinnews.com",
         "title":"Pension Funds Increasingly Eyeing Bitcoin Investments: Fidelity",
         "description":"Pension funds, traditionally known for their conservative investment strategies, are gradually warming up to the idea of diving into the world of Bitcoin. Recent reports from financial giants like Fidelity indicate a significant shift in attitude towards Bitc…",
         "url":"https://biztoc.com/x/f9189288688dcd4c",
         "urlToImage":"https://c.biztoc.com/p/f9189288688dcd4c/s.webp",
         "publishedAt":"2024-05-04T12:52:09Z",
         "content":"Pension funds, traditionally known for their conservative investment strategies, are gradually warming up to the idea of diving into the world of Bitcoin.Recent reports from financial giants like Fid… [+287 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"bitcoinnews.com",
         "title":"Hayes: Bitcoin Bottom is In, Slow and Steady Growth Ahead",
         "description":"Former BitMEX CEO Arthur Hayes has recently made predictions about bitcoin’s future trajectory. In a recent blog post, Hayes shares his analysis of the recent market turbulence and offers insights into where bitcoin might be heading next. His insights and per…",
         "url":"https://biztoc.com/x/17b278b62a61271b",
         "urlToImage":"https://c.biztoc.com/p/17b278b62a61271b/s.webp",
         "publishedAt":"2024-05-04T12:52:09Z",
         "content":"Former BitMEX CEO Arthur Hayes has recently made predictions about bitcoins future trajectory.In a recent blog post, Hayes shares his analysis of the recent market turbulence and offers insights into… [+297 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"bitcoinnews.com",
         "title":"Is Bitcoin Ready for a Comeback? M2 Money Supply Suggests So",
         "description":"In recent weeks, Bitcoin has faced significant selling pressure, causing concern among investors. However, there’s still hope on the horizon. The M2 money supply, a key economic indicator, has turned positive for the first time since November 2022. This shift…",
         "url":"https://biztoc.com/x/9c1390ce64e6f785",
         "urlToImage":"https://c.biztoc.com/p/9c1390ce64e6f785/s.webp",
         "publishedAt":"2024-05-04T12:52:08Z",
         "content":"In recent weeks, Bitcoin has faced significant selling pressure, causing concern among investors. However, theres still hope on the horizon.The M2 money supply, a key economic indicator, has turned p… [+295 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"bitcoinnews.com",
         "title":"Congressmen Urge SEC to Approve Options on Spot Bitcoin ETFs",
         "description":"Representatives Wiley Nickel of North Carolina and Mike Flood of Nebraska are urging the Securities and Exchange Commission (SEC) to swiftly approve the listing and trading of options on spot bitcoin Exchange-Traded Funds (ETFs). Bitcoin Options Trading: Bitc…",
         "url":"https://biztoc.com/x/ece20ff6cc52065f",
         "urlToImage":"https://c.biztoc.com/p/ece20ff6cc52065f/s.webp",
         "publishedAt":"2024-05-04T12:52:08Z",
         "content":"Representatives Wiley Nickel of North Carolina and Mike Flood of Nebraska are urging the Securities and Exchange Commission (SEC) to swiftly approve the listing and trading of options on spot bitcoin… [+297 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"NDTV News"
         },
         "author":null,
         "title":"Probe Agency Arrests Man, Seizes Bitcoin Worth Rs 130 Crore",
         "description":"The Enforcement Directorate on Saturday said it has seized cryptocurrency worth more than Rs 130 crore and arrested a Uttarakhand-based man as part of a drugs trafficking-linked money laundering probe initiated on the request of US authorities.",
         "url":"https://www.ndtv.com/india-news/probe-agency-arrests-man-seizes-crores-cryptocurrency-worth-rs-130-crores-in-us-requested-probe-5587961",
         "urlToImage":"https://c.ndtvimg.com/2021-01/kl45clug_bitcoin-generic_625x300_18_January_21.jpg",
         "publishedAt":"2024-05-04T12:47:16Z",
         "content":"Most of the sales were made in European countries, said the probe agency. (Representational)\r\nNew Delhi: The Enforcement Directorate on Saturday said it has seized cryptocurrency worth more than Rs 1… [+2262 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"nobsbitcoin.com",
         "title":"OpenSats Receives Additional $21M Funding from #startsmall Initiative",
         "description":"No Bullshit Bitcoin is funded by our community. \"We are thrilled to announce that OpenSats has received an additional donation of $21M from #startsmall, Jack Dorsey's philanthropic initiative,\" announced OpenSats. \"This donation will top up our funds and oper…",
         "url":"https://biztoc.com/x/9eb3712288874283",
         "urlToImage":"https://c.biztoc.com/p/9eb3712288874283/s.webp",
         "publishedAt":"2024-05-04T12:36:06Z",
         "content":"No Bullshit Bitcoin is funded by our community.\"We are thrilled to announce that OpenSats has received an additional donation of $21M from #startsmall, Jack Dorsey's philanthropic initiative,\" announ… [+264 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"podcasters.spotify.com",
         "title":"503: The Bitcoin Stack with Dhruv Bansal,Ryan Gentry & Allen Farrington",
         "description":"Marty sits down with Dhruv, Ryan and Allen to discuss their new article on decentralizing the internet with Bitcoin. Dhruv on Twitter: https://twitter.com/dhruvbansal Ryan on Twitter: https://twitter.com/RyanTheGentry Allen on Twitter: https://twitter.com/all…",
         "url":"https://biztoc.com/x/681edd1c2aec0de4",
         "urlToImage":"https://c.biztoc.com/p/681edd1c2aec0de4/s.webp",
         "publishedAt":"2024-05-04T12:27:21Z",
         "content":"Marty sits down with Dhruv, Ryan and Allen to discuss their new article on decentralizing the internet with Bitcoin.Dhruv on Twitter: https://twitter.com/dhruvbansalRyan on Twitter: https://twitter.c… [+272 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coinpedia.org",
         "title":"Shiba Inu Defies Market Trends with a Staggering 1009% Surge in Burn Rate",
         "description":"The post Shiba Inu Defies Market Trends with a Staggering 1009% Surge in Burn Rate appeared first on Coinpedia Fintech News Shiba Inu, one of the top meme coins by global market cap, is in the news again with a major update. Despite recent significant selloff…",
         "url":"https://biztoc.com/x/a3db28e1acf4060a",
         "urlToImage":"https://c.biztoc.com/p/a3db28e1acf4060a/s.webp",
         "publishedAt":"2024-05-04T12:24:08Z",
         "content":"The post Shiba Inu Defies Market Trends with a Staggering 1009% Surge in Burn Rate appeared first on Coinpedia Fintech NewsShiba Inu, one of the top meme coins by global market cap, is in the news ag… [+275 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Alphafreepress.gr"
         },
         "author":"Ξένη Κιτζόγλου",
         "title":"Αλεξάντερ Βίνικ απόφαση: Δήλωσε την ενοχή του ο «Mr Bitcoin»",
         "description":"Αλεξάντερ Βίνικ απόφαση: Ο Ρώσος «Mr Bitcoin» κατηγορήθηκε ότι ξέπλυνε περισσότερα από 4 δισ. δολάρια μέσω bitcoin - Συνελήφθη το 2017 στην Ελλάδα, εκδόθηκε στη Γαλλία και τελικά κατέληξε στις ΗΠΑ",
         "url":"https://www.alphafreepress.gr/2024/05/04/kosmos/aleksanter-vinik-apofasi-dilose-tin-enoxi-tou-o-mr-bitcoin/",
         "urlToImage":"https://www.alphafreepress.gr/wp-content/uploads/2024/05/vinnik.jpg",
         "publishedAt":"2024-05-04T12:20:16Z",
         "content":", 2017 , , , TASS, .     , ,  «Mr Bitcoin»,  10 .\r\n« » , . « . 10 ». 4 . bitcoin. 2017 , , , 2022.\r\nBTC-e, bitcoin « ». 55 , .\r\n: Protothema.gr"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"cryptopotato.com",
         "title":"We Asked ChatGPT if Bitcoin (BTC) Can Reach a New ATH This Month",
         "description":"TL;DR Bitcoin’s price dipped recently but has begun to recover, raising hopes for a potential rally in May. Favorable regulations and increased institutional adoption could fuel a significant BTC price rally (according to ChatGPT). What Are the Odds of a BTC …",
         "url":"https://biztoc.com/x/761cedb9cd7c8dc0",
         "urlToImage":"https://c.biztoc.com/p/761cedb9cd7c8dc0/s.webp",
         "publishedAt":"2024-05-04T12:14:08Z",
         "content":"TL;DRBitcoins price dipped recently but has begun to recover, raising hopes for a potential rally in May.Favorable regulations and increased institutional adoption could fuel a significant BTC price … [+239 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"bankless.com",
         "title":"Crypto's Volatility Summer on Bankless",
         "description":"Bounce with it. Crypto markets were jostled about by macroeconomic factors this week, meanwhile the degens were basking in new tokens after the arrival of numerous high-profile airdrops! What happened in markets this week? Bitcoin started out the week at $63k…",
         "url":"https://biztoc.com/x/2d13ec0f5927517a",
         "urlToImage":"https://c.biztoc.com/p/2d13ec0f5927517a/s.webp",
         "publishedAt":"2024-05-04T12:12:12Z",
         "content":"Bounce with it. Crypto markets were jostled about by macroeconomic factors this week, meanwhile the degens were basking in new tokens after the arrival of numerous high-profile airdrops! What happene… [+254 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coinpedia.org",
         "title":"Bitcoin Enters Phase 2 of Bull Run Says Top Crypto Analyst",
         "description":"The post Bitcoin Enters Phase 2 of Bull Run Says Top Crypto Analyst – Here’s What To Expect Now? appeared first on Coinpedia Fintech News After weeks of correction, the price of Bitcoin has surged back above $64,000 today, marking a significant rebound for th…",
         "url":"https://biztoc.com/x/d797ad82c6fb1c94",
         "urlToImage":"https://c.biztoc.com/p/d797ad82c6fb1c94/s.webp",
         "publishedAt":"2024-05-04T12:10:10Z",
         "content":"The post Bitcoin Enters Phase 2 of Bull Run Says Top Crypto Analyst Heres What To Expect Now? appeared first on Coinpedia Fintech NewsAfter weeks of correction, the price of Bitcoin has surged back a… [+284 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"finance.yahoo.com",
         "title":"The Halving and Bitcoin Mining: 3 Things to Know Before Investing in This Explosive Industry",
         "description":"History shows that during bull markets, Bitcoin (CRYPTO: BTC) miners almost always outperform the cryptocurrency itself. Yet over the past few months, Bitcoin miners have been hit particularly hard as investors poured into spot Bitcoin ETFs as a means of Bitc…",
         "url":"https://biztoc.com/x/cf40403066e88c60",
         "urlToImage":"https://c.biztoc.com/p/cf40403066e88c60/s.webp",
         "publishedAt":"2024-05-04T12:06:04Z",
         "content":"History shows that during bull markets, Bitcoin (CRYPTO: BTC) miners almost always outperform the cryptocurrency itself. Yet over the past few months, Bitcoin miners have been hit particularly hard a… [+261 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"finbold.com",
         "title":"Opportunity? Here’s Bitcoin’s ‘most optimal buy’ entry before parabolic rally",
         "description":"The price of Bitcoin (BTC) has surged above the $60,000 mark, coinciding with a rise in the stock market amidst a weaker-than-expected US jobs report. Consequently, there is a consensus that Bitcoin is poised for further gains, and cryptocurrency trading expe…",
         "url":"https://biztoc.com/x/3a4d59149c40454e",
         "urlToImage":"https://c.biztoc.com/p/3a4d59149c40454e/s.webp",
         "publishedAt":"2024-05-04T12:02:13Z",
         "content":"The price of Bitcoin (BTC) has surged above the $60,000 mark, coinciding with a rise in the stock market amidst a weaker-than-expected US jobs report. Consequently, there is a consensus that Bitcoin … [+259 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Researchbuzz.me"
         },
         "author":"ResearchBuzz",
         "title":"New Zealand Band T-Shirts, Google Play, Twitter, More: Saturday ResearchBuzz, May 4, 2024",
         "description":"NEW RESOURCES New Zealand Herald: Thrashed, Threadbare T-Shirts Are In The Spotlight For NZ Music Month. “All that history makes this garb ripe for a retrospective, and that’s exactly what the New […]",
         "url":"https://researchbuzz.me/2024/05/04/new-zealand-band-t-shirts-google-play-twitter-more-saturday-researchbuzz-may-4-2024/",
         "urlToImage":"https://s0.wp.com/i/blank.jpg",
         "publishedAt":"2024-05-04T12:01:11Z",
         "content":"NEW RESOURCES\r\nNew Zealand Herald: Thrashed, Threadbare T-Shirts Are In The Spotlight For NZ Music Month. “All that history makes this garb ripe for a retrospective, and thats exactly what the New Ze… [+5856 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coingape.com",
         "title":"Crypto Price Prediction 4/5: Record Inflows into ETFs Fuel Fresh Recovery in Bitcoin",
         "description":"Crypto Price Prediction: The cryptocurrency market has been witnessing a renewed buying interest since Thursday following the Bitcoin price reversal from $56500. The bullish turnaround has uplifted the BTC price to $63169, registering a 6% increase since yest…",
         "url":"https://biztoc.com/x/c31fbedbba701d57",
         "urlToImage":"https://c.biztoc.com/p/c31fbedbba701d57/s.webp",
         "publishedAt":"2024-05-04T12:00:11Z",
         "content":"Crypto Price Prediction: The cryptocurrency market has been witnessing a renewed buying interest since Thursday following the Bitcoin price reversal from $56500. The bullish turnaround has uplifted t… [+281 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"HuffPost"
         },
         "author":"Caragh Donley",
         "title":"I Came Out As Trans At 63. People Ask Me Lots Of Questions, But There's 1 That Scares Me Most.",
         "description":"\"As grateful as I am to now be living as my truest self, there are days when everything feels hard. Sometimes too hard.\"",
         "url":"https://www.huffpost.com/entry/coming-out-trans-63-bingo_n_662550abe4b0bf7f0138c5ce",
         "urlToImage":"https://img.huffingtonpost.com/asset/662f8d282200008823fc77b4.png?cache=mwP1DEojqG&ops=1200_630",
         "publishedAt":"2024-05-04T11:58:18Z",
         "content":"\"For decades before transition, I wished I could successfully give a sexy stare for the camera,\" the author writes. \"A year into transition, I'm clearly still wishing.\"\r\nYouve no doubt never heard of… [+17986 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"bankless.com",
         "title":"Airdrop Season's Main Event on Bankless",
         "description":"Two of the largest, if not the largest, airdrops, EigenLayer and Friend.tech, debuted this week. largely disappointed users with plenty of quibbles over geo-blocking, governance, equity distribution, and non-transferrable tokens. However, EigenLayer proved re…",
         "url":"https://biztoc.com/x/91b0a8e3a4418018",
         "urlToImage":"https://c.biztoc.com/p/91b0a8e3a4418018/s.webp",
         "publishedAt":"2024-05-04T11:58:09Z",
         "content":"Two of the largest, if not the largest, airdrops, EigenLayer and Friend.tech, debuted this week. largely disappointed users with plenty of quibbles over geo-blocking, governance, equity distribution,… [+287 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coinpedia.org",
         "title":"Best Cryptos To Buy in the Dip With 10x Bullish Potential in May",
         "description":"The post Best Cryptos To Buy in the Dip With 10x Bullish Potential in May appeared first on Coinpedia Fintech News It has been a mixed adventure for many cryptocurrencies since the turn of the year. Bitcoin’s unprecedented surge to a new all-time high record …",
         "url":"https://biztoc.com/x/f6cad4b10bcdd257",
         "urlToImage":"https://c.biztoc.com/p/f6cad4b10bcdd257/s.webp",
         "publishedAt":"2024-05-04T11:56:08Z",
         "content":"The post Best Cryptos To Buy in the Dip With 10x Bullish Potential in May appeared first on Coinpedia Fintech NewsIt has been a mixed adventure for many cryptocurrencies since the turn of the year. B… [+308 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Protothema.gr"
         },
         "author":null,
         "title":"Αλεξάντερ Βίνικ: Δήλωσε ενοχή στις ΗΠΑ έπειτα από συμφωνία με τους εισαγγελείς - Περιμένει κάθειρξη μέχρι 10 έτη",
         "description":"Ο Ρώσος Αλεξάντερ Βίνικ κατηγορήθηκε ότι ξέπλυνε περισσότερα από 4 δισ. δολάρια μέσω bitcoin - Συνελήφθη το 2017 στην Ελλάδα, εκδόθηκε στη Γαλλία και τελικά κατέληξε στις ΗΠΑ | Αλεξάντερ Βίνικ | Ξέπλυμα | Κρυπτονόμισμα | Bitcoin | Κόσμος",
         "url":"https://www.protothema.gr/world/article/1494693/alexader-vinik-dilose-enohi-stis-ipa-o-mr-bitcoin-epeita-apo-sumfonia-me-tous-eisaggeleis/",
         "urlToImage":"https://i1.prth.gr/images/640x360share/files/2018-07-13/vinik.jpg",
         "publishedAt":"2024-05-04T11:51:56Z",
         "content":"Content snippet: CookieBar"
      },
      {
         "source":{
            "id":null,
            "name":"ETF Daily News"
         },
         "author":"MarketBeat News",
         "title":"TeraWulf (NASDAQ:WULF) Shares Gap Up to $2.12",
         "description":"TeraWulf Inc. (NASDAQ:WULF – Get Free Report)’s share price gapped up prior to trading on Thursday . The stock had previously closed at $2.12, but opened at $2.27. TeraWulf shares last traded at $2.14, with a volume of 2,142,429 shares traded. Analyst Ratings…",
         "url":"https://www.etfdailynews.com/2024/05/04/terawulf-nasdaqwulf-shares-gap-up-to-2-12/",
         "urlToImage":"https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/terawulf-inc-logo-1200x675.jpg?v=20220113215326&w=240&h=240&zc=2",
         "publishedAt":"2024-05-04T11:50:43Z",
         "content":"TeraWulf Inc. (NASDAQ:WULF – Get Free Report)’s share price gapped up prior to trading on Thursday . The stock had previously closed at $2.12, but opened at $2.27. TeraWulf shares last traded at $2.1… [+2756 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"finbold.com",
         "title":"Bitcoin ETF breaks 80-day losing streak with bullish BTC inflow",
         "description":"continues to recover, United States spot exchange-traded funds (ETFs) linked to the cryptocurrency have registered record net inflows. The Grayscale Bitcoin Trust ETF (GBTC) has successfully ended its 80-day losing streak, capturing a significant $63 million …",
         "url":"https://biztoc.com/x/8d4a3358d8f3ef4b",
         "urlToImage":"https://c.biztoc.com/p/8d4a3358d8f3ef4b/s.webp",
         "publishedAt":"2024-05-04T11:48:10Z",
         "content":"continues to recover, United States spot exchange-traded funds (ETFs) linked to the cryptocurrency have registered record net inflows.The Grayscale Bitcoin Trust ETF (GBTC) has successfully ended its… [+273 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coingape.com",
         "title":"XRP Price Soars 3%, Here’s Why",
         "description":"The recent surge in XRP’s price, witnessing a 3% increase, marks a significant pause in its downward trend. Coingape Media reports strong demand at the $0.48 level, highlighted by long rejection candles on the daily chart. These candles underscore buyers’ det…",
         "url":"https://biztoc.com/x/59928a1876aeedb7",
         "urlToImage":"https://c.biztoc.com/p/59928a1876aeedb7/s.webp",
         "publishedAt":"2024-05-04T11:46:09Z",
         "content":"The recent surge in XRPs price, witnessing a 3% increase, marks a significant pause in its downward trend. Coingape Media reports strong demand at the $0.48 level, highlighted by long rejection candl… [+299 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"dailyhodl.com",
         "title":"Crypto Trader Says Top Ethereum Rival Primed for Massive Bull Run Ahead, Updates Outlook on Bitcoin",
         "description":"A closely followed crypto strategist believes that one Ethereum (ETH) competitor is ripe to witness steep bursts to the upside. Trader Ali Martinez tells his 61,400 followers on the social media platform X that he is bullish on Cardano (ADA). According to the…",
         "url":"https://biztoc.com/x/0a4f1420a0373662",
         "urlToImage":"https://c.biztoc.com/p/0a4f1420a0373662/s.webp",
         "publishedAt":"2024-05-04T11:46:08Z",
         "content":"A closely followed crypto strategist believes that one Ethereum (ETH) competitor is ripe to witness steep bursts to the upside.Trader Ali Martinez tells his 61,400 followers on the social media platf… [+303 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"The Daily Hodl"
         },
         "author":"Mark Emem",
         "title":"Crypto Trader Says Top Ethereum Rival Primed for Massive Bull Run Ahead, Updates Outlook on Bitcoin",
         "description":"A closely followed crypto strategist believes that one Ethereum (ETH) competitor is ripe to witness steep bursts to the upside. Trader Ali Martinez tells his 61,400 followers on the social media platform X that he is bullish on Cardano (ADA). According to the…",
         "url":"https://dailyhodl.com/2024/05/04/crypto-trader-says-top-ethereum-rival-primed-for-massive-bull-run-ahead-updates-outlook-on-bitcoin/",
         "urlToImage":"https://dailyhodl.com/wp-content/uploads/2023/06/outline-dream-structure-crypto.jpg",
         "publishedAt":"2024-05-04T11:45:37Z",
         "content":"A closely followed crypto strategist believes that one Ethereum (ETH) competitor is ripe to witness steep bursts to the upside.\r\nTrader Ali Martinez tells his 61,400 followers on the social media pla… [+1885 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Skai.gr"
         },
         "author":"Newsroom",
         "title":"ΗΠΑ: Ο Mr Bitcoin δήλωσε ένοχος για... 10 χρόνια φυλακή - Η συμφωνία με την εισαγγελία",
         "description":"Ο Αλεξάντερ Βίνικ ξέπλενε χρήματα μέσω πλατφόρμας κρυπτονομισμάτων",
         "url":"https://www.skai.gr/news/world/vinik-dilose-enoxos-gia-10-xronia-fylaki-i-symfonia-me-tin-eisaggelia",
         "urlToImage":"https://cdn.skai.gr/sites/default/files/styles/article_16_9/public/2024-05/vinnik_ap.jpg?itok=Ugdv_vST",
         "publishedAt":"2024-05-04T11:30:01Z",
         "content":", 2017 , , , TASS, .\r\n , , «Mr Bitcoin», 10 .\r\n« » , . « . 10 ».\r\n 4 . bitcoin. 2017 , , , 2022.\r\n BTC-e, bitcoin « ».\r\n 55 , . \r\n .Skai.gr Google News ."
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coinpedia.org",
         "title":"3 Coins to Watch in May: $DOGE, $PEPE & $GFOX",
         "description":"The post 3 Coins to Watch in May: $DOGE, $PEPE & $GFOX appeared first on Coinpedia Fintech News Memecoins like Doge, PEPE and $GFOX top investors’ radar in the altcoin landscape. Utility memecoins like $GFOX aim to build on the foundation created by Dogecoin …",
         "url":"https://biztoc.com/x/7561b34ca410e0fc",
         "urlToImage":"https://c.biztoc.com/p/7561b34ca410e0fc/s.webp",
         "publishedAt":"2024-05-04T11:28:07Z",
         "content":"The post 3 Coins to Watch in May: $DOGE, $PEPE &amp; $GFOX appeared first on Coinpedia Fintech NewsMemecoins like Doge, PEPE and $GFOX top investors radar in the altcoin landscape.Utility memecoins l… [+298 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"forbes.com",
         "title":"‘The Dollar Will Be Worth Nothing’",
         "description":"Bitcoin has bounced back following a \"perfect storm\" this week, helping by a shock BlackRock bombshell that could trigger bitcoin price chaos. Subscribe now to Forbes' CryptoAsset & Blockchain Advisor and \"uncover blockchain blockbusters poised for 1,000% plu…",
         "url":"https://biztoc.com/x/4e35e0265c990ff4",
         "urlToImage":"https://c.biztoc.com/p/4e35e0265c990ff4/s.webp",
         "publishedAt":"2024-05-04T11:26:07Z",
         "content":"Bitcoin has bounced back following a \"perfect storm\" this week, helping by a shock BlackRock bombshell that could trigger bitcoin price chaos.Subscribe now to Forbes' CryptoAsset &amp; Blockchain Adv… [+292 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"thecryptobasic.com",
         "title":"Here are 5 Factors Behind the Massive Shiba Inu Bullish Frenzy Today",
         "description":"Shiba Inu has responded to crucial developments this week, helping the asset reclaim $0.00002501. In the last 24 hours, Shiba Inu’s market value has reached $0.00002501, the highest today at the time of reporting. The intraday peak marks a significant 9.4% up…",
         "url":"https://biztoc.com/x/e87a7c60c3930af0",
         "urlToImage":"https://c.biztoc.com/p/e87a7c60c3930af0/s.webp",
         "publishedAt":"2024-05-04T11:24:04Z",
         "content":"Shiba Inu has responded to crucial developments this week, helping the asset reclaim $0.00002501.In the last 24 hours, Shiba Inus market value has reached $0.00002501, the highest today at the time o… [+263 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"cryptopotato.com",
         "title":"Bitcoin Miners Increase Selling Activity as BTC Demand Growth Slows Down: CryptoQuant",
         "description":"CryptoQuant analysts have found that Bitcoin miners have increased their selling activity in the last month amid slow demand growth for BTC. According to the latest CryptoQuant weekly report, the decrease in BTC demand is evident in low Bitcoin whale demand, …",
         "url":"https://biztoc.com/x/608bc34afd43889a",
         "urlToImage":"https://c.biztoc.com/p/608bc34afd43889a/s.webp",
         "publishedAt":"2024-05-04T11:18:07Z",
         "content":"CryptoQuant analysts have found that Bitcoin miners have increased their selling activity in the last month amid slow demand growth for BTC.According to the latest CryptoQuant weekly report, the decr… [+253 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Forbes"
         },
         "author":"Billy Bambrough, Senior Contributor, \n Billy Bambrough, Senior Contributor\n https://www.forbes.com/sites/billybambrough/",
         "title":"‘The Dollar Will Be Worth Nothing’—Elon Musk Issues Stark Fed Warning As ‘Stealth Money Printing’ Grinds Bitcoin, Ethereum And XRP Price Higher",
         "description":"Tesla billionaire Elon Musk has warned the U.S. dollar could be heading for collapse as \"steal money printing\" could push the price of bitcoin, ethereum, XRP and crypto higher...",
         "url":"https://www.forbes.com/sites/digital-assets/2024/05/04/the-dollar-will-be-worth-nothing-elon-musk-issues-stark-fed-warning-as-stealth-money-printing-grinds-bitcoin-ethereum-and-xrp-price-higher/",
         "urlToImage":"https://imageio.forbes.com/specials-images/imageserve/62dd5b26d6efed46c0697810/0x0.jpg?format=jpg&crop=4826,3230,x180,y150,safe&height=900&width=1600&fit=bounds",
         "publishedAt":"2024-05-04T11:15:08Z",
         "content":"BitcoinBitcoin\r\n has bounced back following a \"perfect storm\" this week, helping by a shock BlackRock bombshell that could trigger bitcoin price chaos.\r\nSubscribe now to Forbes' CryptoAsset &amp; Blo… [+3812 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"cryptoslate.com",
         "title":"The rise of Bitcoin ETFs and future market implications",
         "description":"The following is a guest post from Shane Neagle. Regardless of an asset’s fundamentals, its value is governed by one underlying feature – market liquidity. Is it easy for the wider public to sell or buy this asset? If the answer is yes, then the asset receive…",
         "url":"https://biztoc.com/x/7b00ac24fcb37eb2",
         "urlToImage":"https://c.biztoc.com/p/7b00ac24fcb37eb2/s.webp",
         "publishedAt":"2024-05-04T11:08:06Z",
         "content":"The following is a guest post from Shane Neagle.Regardless of an assets fundamentals, its value is governed by one underlying feature market liquidity. Is it easy for the wider public to sell or buy … [+287 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"dlnews.com",
         "title":"US senators warn on Iran Bitcoin mining industry, demand officials answer questions about revenue",
         "description":"Senators warn on Iran Bitcoin mining US senators Elizabeth Warren (D-Mass.) and Angus King (I-Maine) this week warned in a letter to government officials that Iran’s Bitcoin mining industry has created a revenue stream big enough to weaken the effects of econ…",
         "url":"https://biztoc.com/x/0b09d80a4283a548",
         "urlToImage":"https://c.biztoc.com/p/0b09d80a4283a548/s.webp",
         "publishedAt":"2024-05-04T11:04:09Z",
         "content":"Senators warn on Iran Bitcoin miningUS senators Elizabeth Warren (D-Mass.) and Angus King (I-Maine) this week warned in a letter to government officials that Irans Bitcoin mining industry has created… [+290 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coinpedia.org",
         "title":"Trading Legend Peter Brandt Says Bitcoin to Skyrocket to $125,000",
         "description":"The post Trading Legend Peter Brandt Says Bitcoin to Skyrocket to $125,000—Here’s Why appeared first on Coinpedia Fintech News The acclaimed trader Peter Brandt has ignited a debate in the crypto community with his bullish BTC predictions from his valuable ex…",
         "url":"https://biztoc.com/x/07c5f6a9f6e3ca44",
         "urlToImage":"https://c.biztoc.com/p/07c5f6a9f6e3ca44/s.webp",
         "publishedAt":"2024-05-04T11:00:09Z",
         "content":"The post Trading Legend Peter Brandt Says Bitcoin to Skyrocket to $125,000Heres Why appeared first on Coinpedia Fintech NewsThe acclaimed trader Peter Brandt has ignited a debate in the crypto commun… [+285 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coinpedia.org",
         "title":"Bitgert Coin Takes the Crypto World by Storm in May 2024!",
         "description":"The post Bitgert Coin Takes the Crypto World by Storm in May 2024! appeared first on Coinpedia Fintech News Crypto experts predict that the market bottom has arrived and that it will only look up from here. Bitcoin is back above $61K, and the other blue-chip …",
         "url":"https://biztoc.com/x/78285a5163e3c67d",
         "urlToImage":"https://c.biztoc.com/p/78285a5163e3c67d/s.webp",
         "publishedAt":"2024-05-04T11:00:09Z",
         "content":"The post Bitgert Coin Takes the Crypto World by Storm in May 2024! appeared first on Coinpedia Fintech NewsCrypto experts predict that the market bottom has arrived and that it will only look up from… [+278 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coinpedia.org",
         "title":"10 Easy Ways to Earn Passive Income with Cryptocurrency in 2024",
         "description":"The post 10 Easy Ways to Earn Passive Income with Cryptocurrency in 2024 – Safe and Secure appeared first on Coinpedia Fintech News Looking to earn some quick cash in just a few days? Well, there are plenty of online and offline ways to do so nowadays. In 202…",
         "url":"https://biztoc.com/x/808f98d8a6d98ae9",
         "urlToImage":"https://c.biztoc.com/p/808f98d8a6d98ae9/s.webp",
         "publishedAt":"2024-05-04T11:00:09Z",
         "content":"The post 10 Easy Ways to Earn Passive Income with Cryptocurrency in 2024 Safe and Secure appeared first on Coinpedia Fintech NewsLooking to earn some quick cash in just a few days? Well, there are pl… [+306 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Idnes.cz"
         },
         "author":"Kateřina Vaníčková",
         "title":"Stát do dražby posílá přes 4 bitcoiny, vyvolávací cena přesahuje 6 milionů Kč",
         "description":"Úřad pro zastupování státu ve věcech majetkových chystá aukci 4,7 bitcoinu. Dražba odstartuje v 15. května a potrvá jeden den. Vyvolávací cena přesahuje šest milionů korun. Stát již koncem loňského roku dražil 0,4 bitcoinu, zájemce jej nakonec získal za 315 t…",
         "url":"https://www.idnes.cz/zpravy/domaci/stat-majetek-prodej-virtualni-mena-miliony-korun-bitcoin-aukce.A240504_103127_domaci_vank",
         "urlToImage":"https://1gr.cz/tempimg/fb/2022/1/LUH90ba2a_Depositphotos_42771863_XL.jpg",
         "publishedAt":"2024-05-04T10:59:00Z",
         "content":"Pedmtem aukce je 4,70491065 jednotek virtuální mny bitcoin (BTC). Upozorujeme na skutenost, e hodnota nejniího podání bude stanovena jako 95 procent výe XBP indexu k 8:00 hod. CET ke dni, kdy nastane… [+1279 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"CryptoSlate"
         },
         "author":"Shane Neagle",
         "title":"The rise of Bitcoin ETFs and future market implications",
         "description":"The following is a guest post from Shane Neagle. Regardless of an asset’s fundamentals, its value is governed by one underlying feature – market liquidity. Is it easy for the wider public to sell or buy this asset?  If the answer is yes, then the asset receiv…",
         "url":"https://cryptoslate.com/the-rise-of-bitcoin-etfs-and-future-market-implications/",
         "urlToImage":"https://cryptoslate.com/wp-content/uploads/2024/05/bitcoin-etf.jpg",
         "publishedAt":"2024-05-04T10:54:52Z",
         "content":"The following is a guest post from Shane Neagle.\r\nRegardless of an assets fundamentals, its value is governed by one underlying feature – market liquidity. Is it easy for the wider public to sell or … [+8501 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coingape.com",
         "title":"$2.3B Crypto VC Investment Falls Short Of Bitcoin Price Surge, Here’s Why",
         "description":"Crypto venture capitalists have not been keeping pace with the Bitcoin (BTC) price surge lately. Generally, the investment by crypto VCs align with the change in the Bitcoin price, however, that wasn’t the case in the first quarter of FY24. Nonetheless, the v…",
         "url":"https://biztoc.com/x/5274d6cb821db660",
         "urlToImage":"https://c.biztoc.com/p/5274d6cb821db660/s.webp",
         "publishedAt":"2024-05-04T10:50:20Z",
         "content":"Crypto venture capitalists have not been keeping pace with the Bitcoin (BTC) price surge lately. Generally, the investment by crypto VCs align with the change in the Bitcoin price, however, that wasn… [+266 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"investorplace.com",
         "title":"Put $500 in These 3 Coins by 2025",
         "description":"These under-the-radar crypto gems could be the next big winners The recent crypto market correction has been accelerating lately, and not many investors are looking for cryptos to buy right now. I believe this isn’t a cause for concern. Bitcoin (BTC-USD) decl…",
         "url":"https://biztoc.com/x/0b96703d87ef6b14",
         "urlToImage":"https://c.biztoc.com/p/0b96703d87ef6b14/s.webp",
         "publishedAt":"2024-05-04T10:48:13Z",
         "content":"These under-the-radar crypto gems could be the next big winnersThe recent crypto market correction has been accelerating lately, and not many investors are looking for cryptos to buy right now. I bel… [+275 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coinpedia.org",
         "title":"Top Reasons Why Bitcoin and Altcoins Are Up Today?",
         "description":"Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space. The cr…",
         "url":"https://biztoc.com/x/53e052976ac400d6",
         "urlToImage":"https://c.biztoc.com/p/53e052976ac400d6/s.webp",
         "publishedAt":"2024-05-04T10:46:09Z",
         "content":"Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a f… [+291 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coinpedia.org",
         "title":"Memecoins Regains Strength as Bitcoin Recovers: WIF, FLOKI, DOGE & PEPE Price Soar",
         "description":"The post Memecoins Regains Strength as Bitcoin Recovers: WIF, FLOKI, DOGE & PEPE Price Soar appeared first on Coinpedia Fintech News The crypto markets are recovering from the recent loss caused by the drastic drop in the Bitcoin price from around $64,500 to …",
         "url":"https://biztoc.com/x/35841af4839626d7",
         "urlToImage":"https://c.biztoc.com/p/35841af4839626d7/s.webp",
         "publishedAt":"2024-05-04T10:32:07Z",
         "content":"The post Memecoins Regains Strength as Bitcoin Recovers: WIF, FLOKI, DOGE &amp; PEPE Price Soar appeared first on Coinpedia Fintech NewsThe crypto markets are recovering from the recent loss caused b… [+297 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coinpedia.org",
         "title":"Top DeFi Tokens To Maximize Your Profits During The Upcoming Bull Rally!",
         "description":"The post Top DeFi Tokens To Maximize Your Profits During The Upcoming Bull Rally! appeared first on Coinpedia Fintech News The cryptocurrency industry has displayed a strong bullish reversal in its valuation after recording a significant drop due to the cross…",
         "url":"https://biztoc.com/x/f46bc62ee5bfe15f",
         "urlToImage":"https://c.biztoc.com/p/f46bc62ee5bfe15f/s.webp",
         "publishedAt":"2024-05-04T10:32:07Z",
         "content":"The post Top DeFi Tokens To Maximize Your Profits During The Upcoming Bull Rally! appeared first on Coinpedia Fintech NewsThe cryptocurrency industry has displayed a strong bullish reversal in its va… [+292 chars]"
      },
      {
         "source":{
            "id":"wired",
            "name":"Wired"
         },
         "author":"Dhruv Mehrotra, Dell Cameron",
         "title":"A New Surveillance Tool Invades Border Towns",
         "description":"Plus: An assassination plot, an AI security bill, a Project Nimbus revelation, and more of the week’s top security news.",
         "url":"https://www.wired.com/story/border-surveillance-india-assassination-project-nimbus-security-roundup/",
         "urlToImage":"https://media.wired.com/photos/663563ad231b4f48281342dd/191:100/w_1280,c_limit/A-New-Surveillance-Tool-Invades-Border-Towns-Security-GettyImages-2149617416.jpg",
         "publishedAt":"2024-05-04T10:30:00Z",
         "content":"This week, WIRED reported that a group of prolific scammers known as the Yahoo Boys are openly operating on major platforms like Facebook, WhatsApp, TikTok, and Telegram. Evading content moderation s… [+6209 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coingape.com",
         "title":"Top 10 Best Ways to Make Money with Cryptocurrency In 2024",
         "description":"Cryptocurrency trading is about speculating the price movement of a cryptocurrency. It means you conduct technical and fundamental analysis to predict future price of a crypto. Then, you can open a buy or sell position and make a profit with your correct spec…",
         "url":"https://biztoc.com/x/c0bb622a2bc82b60",
         "urlToImage":"https://c.biztoc.com/p/c0bb622a2bc82b60/s.webp",
         "publishedAt":"2024-05-04T10:22:08Z",
         "content":"Cryptocurrency trading is about speculating the price movement of a cryptocurrency. It means you conduct technical and fundamental analysis to predict future price of a crypto. Then, you can open a b… [+269 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"heise online"
         },
         "author":"Marie-Claire Koch",
         "title":"Cybervorfälle: London Drugs lahmgelegt; Datenschutzkatastrophe bei UnitedHealth",
         "description":"Während bei London Drugs die Analysen laufen, nennt das größte US-Gesundheitsunternehmen einen unzureichend gesicherten Server als Ursache für massive Ausfälle.",
         "url":"https://www.heise.de/news/Cybervorfall-bei-London-Drugs-UnitedHealth-Vorfall-betrifft-Millionen-US-Buerger-9708029.html",
         "urlToImage":"https://heise.cloudimg.io/bound/1200x1200/q85.png-lossy-85.webp-lossy-85.foil1/_www-heise-de_/imgs/18/4/5/8/4/7/1/2/shutterstock_2023269704-3b94053f99abe884.jpg",
         "publishedAt":"2024-05-04T10:14:00Z",
         "content":"Fast 80 Läden der kanadischen Apotheken- und Einzelhandelskette London Drugs sind seit rund einer Woche aufgrund eines \"Cybersecurity-Vorfalls\" geschlossen. Laut einer Erklärung des Unternehmens sind… [+3083 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"ambcrypto.com",
         "title":"Michael Saylor vs Cardano’s Hoskinson over ETH’s possible ‘security’ status",
         "description":"Michael Saylor predicts Ethereum will be classified as a crypto-asset security • Charles Hoskinson was quick to respond to the Bitcoin maxi’s comments The United States is taking steps towards regulating the cryptocurrency market, beginning with platforms lik…",
         "url":"https://biztoc.com/x/d6e02b0d3a3a2b03",
         "urlToImage":"https://c.biztoc.com/p/d6e02b0d3a3a2b03/s.webp",
         "publishedAt":"2024-05-04T10:10:06Z",
         "content":"Michael Saylor predicts Ethereum will be classified as a crypto-asset securityCharles Hoskinson was quick to respond to the Bitcoin maxis commentsThe United States is taking steps towards regulating … [+297 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Pausaparafeminices.com"
         },
         "author":"Bruna Tavares",
         "title":"Better Internet casino Opinion To own Web based casinos Within the 2024",
         "description":"Content Die Kommunikation Mit Real time Dealern Und auch Spielern Greatest Free Spin Also offers During the Mobile Casinos Totally free Revolves Along with A good 100percent Deposit Complement To help you 150 Even though they do, they could maybe not give hel…",
         "url":"https://www.pausaparafeminices.com/ppf/better-internet-casino-opinion-to-own-web-based-casinos-within-the-2024/",
         "urlToImage":null,
         "publishedAt":"2024-05-04T10:09:56Z",
         "content":"Even though they do, they could maybe not give help that’s including suitable for all nation. Most web based casinos dislike one to understand the added bonus wagering standards, but our very own rev… [+4986 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coingape.com",
         "title":"XRP Lawyer Slams Michael Saylor Comparing Him With Gary Gensler",
         "description":"Pro-XRP lawyer Bill Morgan has slammed Michael Saylor for his recent remarks on several cryptos like ADA, Ripple’s native crypto XRP, Solana, and others. Commenting on the recent remarks from MicroStrategy co-founder Michael Saylor, Bill Morgan has recently r…",
         "url":"https://biztoc.com/x/a66e252d4a2ce144",
         "urlToImage":"https://c.biztoc.com/p/a66e252d4a2ce144/s.webp",
         "publishedAt":"2024-05-04T10:08:12Z",
         "content":"Pro-XRP lawyer Bill Morgan has slammed Michael Saylor for his recent remarks on several cryptos like ADA, Ripples native crypto XRP, Solana, and others. Commenting on the recent remarks from MicroStr… [+287 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"cryptopotato.com",
         "title":"Price Predictions as of Late",
         "description":"TL;DR XRP has remained resilient amidst a general market downturn, with analysts predicting substantial future gains. The ongoing Ripple v. SEC lawsuit could significantly influence the asset’s price, depending on the outcome. XRP Future Outlooks The latest c…",
         "url":"https://biztoc.com/x/47709a8d528e849d",
         "urlToImage":"https://c.biztoc.com/p/47709a8d528e849d/s.webp",
         "publishedAt":"2024-05-04T10:08:09Z",
         "content":"TL;DRXRP has remained resilient amidst a general market downturn, with analysts predicting substantial future gains.The ongoing Ripple v. SEC lawsuit could significantly influence the assets price, d… [+312 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"decrypt.co",
         "title":"This Week in Coins: Bitcoin Battered But Rebounds As Meme Coin Mania Abides",
         "description":"It was a rough week for Bitcoin—and the wider crypto market—but as of yesterday, things were looking brighter. The price of Bitcoin is now at $63,107. It’s effectively where it was seven days ago, barely down a fraction of a percent, according to CoinGecko da…",
         "url":"https://biztoc.com/x/8d3822fbd19ace3e",
         "urlToImage":"https://c.biztoc.com/p/8d3822fbd19ace3e/s.webp",
         "publishedAt":"2024-05-04T10:06:08Z",
         "content":"It was a rough week for Bitcoinand the wider crypto marketbut as of yesterday, things were looking brighter.The price of Bitcoin is now at $63,107. Its effectively where it was seven days ago, barely… [+300 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Detroit Free Press"
         },
         "author":"Benzinga",
         "title":"First-time home buyer? Yes, it's a tough market, says treasury secretary",
         "description":"Treasury Secretary Janet Yellen highlighted the severe challenges first-time homebuyers face in today's market, describing entry as almost impossible.",
         "url":"https://www.freep.com/story/money/business/2024/05/04/first-time-homebuyer-its-a-tough-market-says-treasury-secretary/73527196007/",
         "urlToImage":"https://s.yimg.com/ny/api/res/1.2/4AqspxYgw8_zAWC.Xmau1g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04NTY-/https://media.zenfs.com/en/detroit-free-press/d9d9b6167870be6db36b0fb9f075a64d",
         "publishedAt":"2024-05-04T10:03:59Z",
         "content":"The stock market breathed a sigh of relief as Fed Chair Jerome Powell eased fears of interest rate hikes amid recent inflation surprises.\r\nThe Fed now plans to hold rates steady longer to ensure infl… [+2390 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Decrypt"
         },
         "author":"Mathew Di Salvo",
         "title":"This Week in Coins: Bitcoin Battered But Rebounds As Meme Coin Mania Abides",
         "description":"From Bitcoin's mid-week plunge to the prurient LIVEMOM pump, it was a wild seven days in crypto.",
         "url":"https://decrypt.co/229314/this-week-in-coins-bitcoin-battered-but-rebounds-as-meme-coin-mania-abides",
         "urlToImage":"https://cdn.decrypt.co/resize/1024/height/512/wp-content/uploads/2024/04/Bitcoin-Rock-Dim-Dimich-shutterstock_706080658-gID_7.jpg",
         "publishedAt":"2024-05-04T10:01:02Z",
         "content":"Illustration by Mitchell Preffer for Decrypt.\r\nIt was a rough week for Bitcoinand the wider crypto marketbut as of yesterday, things were looking brighter. \r\nThe price of Bitcoin is now at $63,107. I… [+2355 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Ambcrypto.com"
         },
         "author":"Ishika Kumari",
         "title":"Michael Saylor vs Cardano’s Hoskinson over ETH’s possible ‘security’ status",
         "description":"It's Saylor v. Hoskinson as the debate over Ether's status heats up",
         "url":"https://ambcrypto.com/michael-saylor-vs-cardanos-hoskinson-over-eths-possible-security-status/",
         "urlToImage":"https://ambcrypto.com/wp-content/uploads/2024/05/Saylor-vs.-Hoskinson-1000x600.webp",
         "publishedAt":"2024-05-04T10:00:25Z",
         "content":"<ul><li>Michael Saylor predicts Ethereum will be classified as a crypto-asset security</li><li>Charles Hoskinson was quick to respond to the Bitcoin maxi’s comments</li></ul>The United States is taki… [+2993 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Criptonoticias.com"
         },
         "author":"Adam Dubove",
         "title":"La privacidad en Bitcoin no será tolerada",
         "description":"Estados Unidos se esfuerza por controlar Bitcoin todo lo que sea posible.\nLeer más",
         "url":"https://www.criptonoticias.com/opinion/privacidad-bitcoin-tolerada-samourai-estados-unidos/",
         "urlToImage":"https://www.criptonoticias.com/wp-content/uploads/2024/03/bitcoin-lupa-papeles-adobe.jpeg",
         "publishedAt":"2024-05-04T10:00:00Z",
         "content":"Hechos clave:\r\n<ul><li>El avance del gobierno contra la privacidad va más allá de Bitcoin.\r\n</li><li>El futuro de Bitcoin depende de las decisiones individuales sobre cómo usarlo.\r\n</li></ul>\r\nLa sem… [+6214 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Bloguismo.com"
         },
         "author":"Anairas",
         "title":"A knowledgeable Bitcoin Gambling enterprise Websites Bitcoin Betting Publication",
         "description":"Blogs Top ten European Online casinos And make A great Matchpay Gambling establishment Put You will want to Anticipate paying Tax On the Gambling Earnings Draftkings Local casino Promotion Grabs 100 In the Choice Credit To own ten Put Us Casino Software Compa…",
         "url":"https://www.bloguismo.com/a-knowledgeable-bitcoin-gambling-enterprise-websites-bitcoin-betting-publication/",
         "urlToImage":"https://g.twimg.com/Twitter_logo_blue.png",
         "publishedAt":"2024-05-04T09:55:11Z",
         "content":"All you need to manage try choose which work with ‘s the really required to your. Online casinos offer unique casino incentives to own newly closed-up players who would like to is actually its casino… [+5305 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Le Soir"
         },
         "author":"Mika",
         "title":"Bitcoin : les mineurs sous haute pression",
         "description":"Malgré la division par deux des récompenses, l’analyste vedette de la crypto-sphère, Ki Young Ji, campe sur ses positions : aucun signe de faiblesse chez les mineurs de bitcoin ! Le halving du 20 avril dernier a secoué le réseau bitcoin. Dorénavant, les mineu…",
         "url":"https://be-crypto.lesoir.be/fr/cryptos/bitcoin/bitcoin-les-mineurs-sous-haute-pression",
         "urlToImage":"https://geeko-media.lesoir.be/wp-content/uploads/2024/05/BITCOIN-MINEURS-1068x580.png",
         "publishedAt":"2024-05-04T09:39:15Z",
         "content":"Malgré la division par deux des récompenses, l’analyste vedette de la crypto-sphère, Ki Young Ji, campe sur ses positions : aucun signe de faiblesse chez les mineurs de bitcoin !\r\nLe halving du 20 av… [+1221 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"bitcoinist.com",
         "title":"Bitcoin Back In The Bullpen: Whales Spark Rebound With Massive $2.8 Billion Purchase",
         "description":"The past few weeks have been a rollercoaster ride for Bitcoin investors. Fears of inflation and geopolitical tensions sent shockwaves through the cryptocurrency market, dragging Bitcoin and its altcoin brethren down to depths not seen since early 2024. Bitcoi…",
         "url":"https://biztoc.com/x/5f91f711fd7b3f5e",
         "urlToImage":"https://c.biztoc.com/p/5f91f711fd7b3f5e/s.webp",
         "publishedAt":"2024-05-04T09:34:04Z",
         "content":"The past few weeks have been a rollercoaster ride for Bitcoin investors. Fears of inflation and geopolitical tensions sent shockwaves through the cryptocurrency market, dragging Bitcoin and its altco… [+270 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"dailyhodl.com",
         "title":"Bitcoin and Other Cryptos Set To Begin ‘Slow Grind Higher,’ Says Arthur Hayes",
         "description":"BitMEX co-founder Arthur Hayes is saying that crypto assets are likely to benefit from the US monetary policy going forward. In a new essay, Hayes says that the U.S. Treasury and the Federal Reserve are engaging in “stealth money printing policies.” According…",
         "url":"https://biztoc.com/x/c77e28d1f37faae3",
         "urlToImage":"https://c.biztoc.com/p/c77e28d1f37faae3/s.webp",
         "publishedAt":"2024-05-04T09:26:07Z",
         "content":"BitMEX co-founder Arthur Hayes is saying that crypto assets are likely to benefit from the US monetary policy going forward.In a new essay, Hayes says that the U.S. Treasury and the Federal Reserve a… [+288 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"investors.com",
         "title":"AI Play, Bitcoin Miner Rally On S&P Index Moves",
         "description":"Electric and power generation firm Vistra (VST) will join the S&P 500 index before Wednesday's open, S&P Dow Jones Indices said Friday night. VST stock will replace Pioneer Natural Resources (PXD), which is being acquired by Exxon Mobil (XOM). Meanwhile, bitc…",
         "url":"https://biztoc.com/x/52f6cf92e4c6ec4f",
         "urlToImage":"https://c.biztoc.com/p/52f6cf92e4c6ec4f/s.webp",
         "publishedAt":"2024-05-04T09:24:06Z",
         "content":"Electric and power generation firm Vistra (VST) will join the S&amp;P 500 index before Wednesday's open, S&amp;P Dow Jones Indices said Friday night. VST stock will replace Pioneer Natural Resources … [+277 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"The Daily Hodl"
         },
         "author":"Mark Emem",
         "title":"Bitcoin and Other Cryptos Set To Begin ‘Slow Grind Higher,’ Says Arthur Hayes – Here Are His Top Altcoin Picks",
         "description":"BitMEX co-founder Arthur Hayes is saying that crypto assets are likely to benefit from the US monetary policy going forward. In a new essay, Hayes says that the U.S. Treasury and the Federal Reserve are engaging in “stealth money printing policies.” According…",
         "url":"https://dailyhodl.com/2024/05/04/bitcoin-and-other-cryptos-set-to-begin-slow-grind-higher-says-arthur-hayes-here-are-his-top-altcoin-picks/",
         "urlToImage":"https://dailyhodl.com/wp-content/uploads/2023/10/0-Blue-chip-Altcoin-.jpg",
         "publishedAt":"2024-05-04T09:15:32Z",
         "content":"BitMEX co-founder Arthur Hayes is saying that crypto assets are likely to benefit from the US monetary policy going forward.\r\nIn a new essay, Hayes says that the U.S. Treasury and the Federal Reserve… [+1478 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"bitcoinist.com",
         "title":"Bitcoin Back In The Bullpen: Whales Spark Rebound With Massive $2.8 Billion Purchase",
         "description":"The past few weeks have been a rollercoaster ride for Bitcoin investors. Fears of inflation and geopolitical tensions sent shockwaves through the cryptocurrency market, dragging Bitcoin and its altcoin brethren down to depths not seen since early 2024. Bitcoi…",
         "url":"https://biztoc.com/x/4a3cfdf44c559732",
         "urlToImage":"https://c.biztoc.com/p/4a3cfdf44c559732/s.webp",
         "publishedAt":"2024-05-04T09:12:07Z",
         "content":"The past few weeks have been a rollercoaster ride for Bitcoin investors. Fears of inflation and geopolitical tensions sent shockwaves through the cryptocurrency market, dragging Bitcoin and its altco… [+301 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coinpedia.org",
         "title":"Is Bitcoin making a comeback? Whales Acquire 47K+ BTC at $2.8 Billion in a Day",
         "description":"The post Is Bitcoin making a comeback? Whales Acquire 47K+ BTC at $2.8 Billion in a Day appeared first on Coinpedia Fintech News Crypto whales are making massive moves, and as a positive outcome, cryptocurrencies have surged in the past 24 hours. On May 3, ma…",
         "url":"https://biztoc.com/x/c5ad6cfc2b2ef376",
         "urlToImage":"https://c.biztoc.com/p/c5ad6cfc2b2ef376/s.webp",
         "publishedAt":"2024-05-04T09:08:09Z",
         "content":"The post Is Bitcoin making a comeback? Whales Acquire 47K+ BTC at $2.8 Billion in a Day appeared first on Coinpedia Fintech NewsCrypto whales are making massive moves, and as a positive outcome, cryp… [+268 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coinpedia.org",
         "title":"Fidelity Unveils $5 Trillion Crypto Potential for Pension Plans: Here’s It Means for You!",
         "description":"Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena. According to local rep…",
         "url":"https://biztoc.com/x/3a229dcfb03d6e4a",
         "urlToImage":"https://c.biztoc.com/274/og.png",
         "publishedAt":"2024-05-04T09:08:08Z",
         "content":"Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching n… [+272 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Bloguismo.com"
         },
         "author":"Anairas",
         "title":"Best Online casino Internet sites In the usa",
         "description":"Blogs What the Greatest Mi Casinos Could offer You Tricks for Australian On-line casino People Online casino Payment Steps The newest Web based casinos Australia All of our top ten best web sites have the ability to the big gambling games participants delight…",
         "url":"https://www.bloguismo.com/best-online-casino-internet-sites-in-the-usa/",
         "urlToImage":"https://g.twimg.com/Twitter_logo_blue.png",
         "publishedAt":"2024-05-04T09:07:09Z",
         "content":"All of our top ten best web sites have the ability to the big gambling games participants delight in. Including a selection of ports, electronic poker, dining table and you will cards for example bla… [+7495 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"finance.yahoo.com",
         "title":"Grayscale's Bitcoin ETF Sees First Inflow After Billions Lost Since January",
         "description":"The Grayscale Bitcoin Trust (GBTC), the largest bitcoin ETF by assets, saw a net inflow of new money from investors, according to Farside Investors, the first daily increase since the product debuted in January. A net $63 million was added on Friday, accordin…",
         "url":"https://biztoc.com/x/ce62da079a15bb11",
         "urlToImage":"https://c.biztoc.com/p/ce62da079a15bb11/s.webp",
         "publishedAt":"2024-05-04T09:04:05Z",
         "content":"The Grayscale Bitcoin Trust (GBTC), the largest bitcoin ETF by assets, saw a net inflow of new money from investors, according to Farside Investors, the first daily increase since the product debuted… [+306 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Bitcoinist"
         },
         "author":"Christian Encila",
         "title":"Bitcoin Back In The Bullpen: Whales Spark Rebound With $2.8 Billion Purchase",
         "description":"The past few weeks have been a rollercoaster ride for Bitcoin investors. Fears of inflation and geopolitical tensions sent shockwaves through the cryptocurrency market, dragging Bitcoin and its altcoin brethren down to depths not seen since early 2024. Bitcoi…",
         "url":"https://bitcoinist.com/bitcoin-whales-lead-massive-2-8-billion-purchase/",
         "urlToImage":"https://bitcoinist.com/wp-content/uploads/2024/05/A_a1a98a.jpg",
         "publishedAt":"2024-05-04T09:00:59Z",
         "content":"The past few weeks have been a rollercoaster ride for Bitcoin investors. Fears of inflation and geopolitical tensions sent shockwaves through the cryptocurrency market, dragging Bitcoin and its altco… [+3204 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Ambcrypto.com"
         },
         "author":"AMBCrypto Team",
         "title":"Ondo Finance Falls Behind ETFSwap (ETFS), Celestia (TIA) And Polkadot (DOT) Suffer Losses",
         "description":"Market dynamics have led to some notable developments in the crypto space lately. One is […]",
         "url":"https://ambcrypto.com/ondo-finance-falls-behind-etfswap-etfs-celestia-tia-and-polkadot-dot-suffer-losses/",
         "urlToImage":"https://ambcrypto.com/wp-content/uploads/2024/05/Screenshot-2024-05-03-223329.png",
         "publishedAt":"2024-05-04T09:00:10Z",
         "content":"Market dynamics have led to some notable developments in the crypto space lately. One is how Ondo Finance (ONDO) has fallen behind ETSwap (ETFS) in the battle among Real World Assets (RWA) crypto pro… [+4319 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"newsBTC"
         },
         "author":"Christian Encila",
         "title":"Shiba Inu In Danger Zone: 15% Price Crash Incoming?",
         "description":"The price of Shiba Inu (SHIB), the self-proclaimed “Dogecoin killer,” has been caught in a technical tug-of-war, with bears attempting to push it lower and bulls clinging to signs of hope. Analysts are scrutinizing the memecoin’s chart pattern and on-chain da…",
         "url":"http://www.newsbtc.com/shiba-inu/shiba-inu-in-danger-zone-18-price-crash-incoming/",
         "urlToImage":"https://www.newsbtc.com/wp-content/uploads/2024/05/a_2b84d1.jpg?fit=5746%2C3620",
         "publishedAt":"2024-05-04T09:00:02Z",
         "content":"The price of Shiba Inu (SHIB), the self-proclaimed “Dogecoin killer,” has been caught in a technical tug-of-war, with bears attempting to push it lower and bulls clinging to signs of hope. Analysts a… [+3231 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coinpedia.org",
         "title":"Bitcoin Maximalist Michael Saylor Predicts XRP, ETH, BNB, and ADA to Never Have ETFs",
         "description":"Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. The MicroStrategy co-founder Michael Saylor, who is also …",
         "url":"https://biztoc.com/x/7385499663c182c9",
         "urlToImage":"https://c.biztoc.com/p/7385499663c182c9/s.webp",
         "publishedAt":"2024-05-04T08:40:07Z",
         "content":"Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchai… [+298 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Pausaparafeminices.com"
         },
         "author":"Bruna Tavares",
         "title":"Greatest Internet casino Philippines 2024",
         "description":"Blogs Playing with Cash Software Playing Real cash Gambling games On the Neteller Casinos On-line casino Deposit Steps: Safety and security Legality And you may Defense Of Ireland Online casinos While you are there is absolutely no app, the fresh casino webpa…",
         "url":"https://www.pausaparafeminices.com/ppf/greatest-internet-casino-philippines-2024/",
         "urlToImage":null,
         "publishedAt":"2024-05-04T08:34:22Z",
         "content":"While you are there is absolutely no app, the fresh casino webpages are optimised to possess mobile have fun with, so if you’re perhaps not a good stickler because of it element, you will be perfectl… [+6799 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"ambcrypto.com",
         "title":"Bitcoin’s long-term projections",
         "description":"Despite this optimistic signal, other metrics point to bearish pressures on the cryptocurrency After major corrections, Bitcoin is finally seeing some positive movement on the price charts, with BTC up by almost 5% in just 24 hours. In fact, at the time of wr…",
         "url":"https://biztoc.com/x/4d652df666891825",
         "urlToImage":"https://c.biztoc.com/p/4d652df666891825/s.webp",
         "publishedAt":"2024-05-04T08:32:05Z",
         "content":"Despite this optimistic signal, other metrics point to bearish pressures on the cryptocurrencyAfter major corrections, Bitcoin is finally seeing some positive movement on the price charts, with BTC u… [+297 chars]"
      },
      {
         "source":{
            "id":"il-sole-24-ore",
            "name":"Il Sole 24 Ore"
         },
         "author":"di Marco Mobili",
         "title":"Criptovalute, è dei Carabinieri la prima confisca e conversione in euro di monete digitali",
         "description":"Per la prima volta le criptovalute sequestrate sono trasformate in euro dall’Arma e destinate a finanziare il Fondo unico di giustizia",
         "url":"https://www.ilsole24ore.com/art/criptovalute-e-carabinieri-prima-confisca-e-conversione-euro-monete-digitali-AFWjvZrD",
         "urlToImage":"https://i2.res.24o.it/images2010/S24/Documenti/2024/05/05/Immagini/Ritagli/07d290a2e9fd54ec8c485dba50fb8182-U35007480426YeG-1440x752@IlSole24Ore-Web.jpg?r=1170x507",
         "publishedAt":"2024-05-04T08:30:46Z",
         "content":"Ascolta la versione audio dell'articolo\r\n2' di lettura\r\nColpo grosso della Sezione Criptovalute del Comando Carabinieri Antifalsificazione Monetaria. Non tanto nellentità delloperazione portata a seg… [+2808 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"cryptopotato.com",
         "title":"Bitcoin Whales Bagged $2.8B Worth of BTC in a Day: CryptoQuant",
         "description":"Bitcoin’s recent market correction that dragged the world’s largest cryptocurrency near the low of $56,500 turned out to be a good opportunity for high-profile investors. Data shared by CryptoQuant CEO Ki Young Ju revealed that whales have accumulated a whopp…",
         "url":"https://biztoc.com/x/f0606fdb7d18dea9",
         "urlToImage":"https://c.biztoc.com/p/f0606fdb7d18dea9/s.webp",
         "publishedAt":"2024-05-04T08:30:08Z",
         "content":"Bitcoins recent market correction that dragged the worlds largest cryptocurrency near the low of $56,500 turned out to be a good opportunity for high-profile investors.Data shared by CryptoQuant CEO … [+254 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Ambcrypto.com"
         },
         "author":"Samuel Edyme",
         "title":"Bitcoin’s long-term projections – Why you should look out for this key indicator!",
         "description":"Bitcoin is recovering on the charts, but there might be more good news for BTC in the long-term.",
         "url":"https://ambcrypto.com/bitcoins-long-term-projections-why-you-should-look-out-for-this-key-indicator/",
         "urlToImage":"https://ambcrypto.com/wp-content/uploads/2024/05/Bitcoin-clock-1-1000x600.webp",
         "publishedAt":"2024-05-04T08:30:07Z",
         "content":"<ul><li>M2 Money Supply’s positive trend suggests greater liquidity could boost Bitcoin</li><li>Despite this optimistic signal, other metrics point to bearish pressures on the cryptocurrency </li></u… [+3062 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"investors.com",
         "title":"S&P 500: AI Play Vistra Joins Index; Bitcoin Miner Marathon Digital Rallies On Demotion",
         "description":"Electric and power generation firm Vistra (VST) will join the S&P 500 index before Wednesday's open, S&P Dow Jones Indices said Friday night. VST stock will replace Pioneer Natural Resources (PXD), which is being acquired by Exxon Mobil (XOM). Meanwhile, bitc…",
         "url":"https://biztoc.com/x/d904dfe50b2dfb05",
         "urlToImage":"https://c.biztoc.com/p/d904dfe50b2dfb05/og.webp",
         "publishedAt":"2024-05-04T08:28:04Z",
         "content":"Electric and power generation firm Vistra (VST) will join the S&amp;P 500 index before Wednesday's open, S&amp;P Dow Jones Indices said Friday night. VST stock will replace Pioneer Natural Resources … [+277 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Investing.com"
         },
         "author":"Reuters",
         "title":"Russian suspected cybercrime kingpin pleads guilty in US, TASS reports",
         "description":"Russian suspected cybercrime kingpin pleads guilty in US, TASS reports",
         "url":"https://www.investing.com/news/world-news/russian-suspected-cybercrime-kingpin-pleads-guilty-in-us-tass-reports-3419590",
         "urlToImage":"https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
         "publishedAt":"2024-05-04T08:25:21Z",
         "content":"MOSCOW (Reuters) - Alexander Vinnik, a Russian suspected cybercrime kingpin who was arrested in Greece in 2017, convicted of money laundering in France three years later and is now awaiting trial in … [+1451 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Corriere.it"
         },
         "author":"Redazione economia",
         "title":"Modello 730 semplificato, le novità: mance, rimborsi e bonus mobili, cosa cambia",
         "description":"Dipendenti e pensionati possono accedere alla dichiarazione precompilata e semplificata grazie ai dati già inseriti dall’Agenzia delle Entrate. Ma ci sono anche altre novità a cui fare attenzione (anche per bitcoin e regime forfettario)Dipendenti e pensionati…",
         "url":"https://www.corriere.it/economia/tasse/cards/dichiarazione-dei-redditi-il-modello-730-ora-e-semplificato-le-novita-dai-rimborsi-a-mance-e-bonus-mobili/nuovo-730-semplificato-online-dal-30-aprile_principale.shtml",
         "urlToImage":"https://dimages2.corriereobjects.it/files/og_thumbnail/uploads/2024/04/30/6630c98a6e4ad.jpeg",
         "publishedAt":"2024-05-04T08:24:20Z",
         "content":"Il 730 semplificato è una realtà. Dal pomeriggio del 30 aprile, infatti, sono andati online - in modalità consultazione - i modelli precompilati per pensionati e dipendenti (più avanti sarà disponibi… [+1239 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Marketscreener.com"
         },
         "author":null,
         "title":"Russian suspected cybercrime kingpin pleads guilty in US, TASS reports",
         "description":"(marketscreener.com) Alexander Vinnik, a Russian suspected cybercrime kingpin who was arrested in Greece in 2017, convicted of money laundering in France three years later and is now awaiting trial in California, has pleaded partially guilty, TASS news agency…",
         "url":"https://www.marketscreener.com/news/latest/Russian-suspected-cybercrime-kingpin-pleads-guilty-in-US-TASS-reports-46630300/",
         "urlToImage":"https://www.marketscreener.com/images/reuters/2024-05/2024-05-04T081454Z_1_LYNXMPEK4301O_RTROPTP_3_USA-RUSSIA-CRYPTOCURRENCY-JUSTICE.JPG",
         "publishedAt":"2024-05-04T08:14:54Z",
         "content":"MOSCOW (Reuters) - Alexander Vinnik, a Russian suspected cybercrime kingpin who was arrested in Greece in 2017, convicted of money laundering in France three years later and is now awaiting trial in … [+1407 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Www.df.cl"
         },
         "author":"María Jesús Doberti",
         "title":"Stablecoins, la llave de la banca para entrar al mundo cripto",
         "description":"Estas monedas digitales podrían ser adoptadas por grandes bancos en Estados Unidos si se aprueba un nuevo proyecto de ley que limita la capacidad actual de este tipo de activo.",
         "url":"https://www.df.cl/senal-df/stablecoins-la-llave-de-la-banca-para-entrar-al-mundo-cripto",
         "urlToImage":"https://www.df.cl/noticias/site/artic/20240503/imag/foto_0000000520240503152912/bitcoin-candlestick-volatility-chart-wo.jpg",
         "publishedAt":"2024-05-04T08:00:00Z",
         "content":"Un nuevo proyecto de ley presentado al Senado de Estados Unidos podría alentar a los bancos de ese país a incursionar en el mercado de las stablecoins, según la firma global de calificaciones, S&amp;… [+4894 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"theblock.co",
         "title":"Grayscale’s GBTC spot bitcoin ETF sees $63 million of inflows, ending 78-day outflow streak",
         "description":"The U.S. spot bitcoin ETFs registered their first daily net inflows since April 23 and the largest since March 13, totaling $378.3 million.",
         "url":"https://biztoc.com/x/7d9e8286972ee51b",
         "urlToImage":"https://c.biztoc.com/p/7d9e8286972ee51b/s.webp",
         "publishedAt":"2024-05-04T07:54:08Z",
         "content":"The U.S. spot bitcoin ETFs registered their first daily net inflows since April 23 and the largest since March 13, totaling $378.3 million.\r\nThis story appeared on theblock.co, ."
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coingape.com",
         "title":"Will Bitcoin Hit $70,000 again? Here’s What You Need to Know",
         "description":"Bitcoin’s recent performance has been marked by significant volatility, with the cryptocurrency testing support levels at $56,500. This testing of support has prompted discussions regarding Bitcoin’s potential to reach the $70,000 price target. A crucial even…",
         "url":"https://biztoc.com/x/41b617de2ca672f4",
         "urlToImage":"https://c.biztoc.com/p/41b617de2ca672f4/s.webp",
         "publishedAt":"2024-05-04T07:48:10Z",
         "content":"Bitcoins recent performance has been marked by significant volatility, with the cryptocurrency testing support levels at $56,500. This testing of support has prompted discussions regarding Bitcoins p… [+280 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Pausaparafeminices.com"
         },
         "author":"Bruna Tavares",
         "title":"Beste Alive Roulette Gambling enterprises 4",
         "description":"Posts The best Casinos on the internet Within the Germany: Rated Look into Payment Steps And you can Rate Gamble 900+ 100 percent free United states Roulette Game Today Ignition Local casino 300percent Around step three,100000 Web based casinos Try Auch Für I…",
         "url":"https://www.pausaparafeminices.com/ppf/beste-alive-roulette-gambling-enterprises-4/",
         "urlToImage":null,
         "publishedAt":"2024-05-04T07:47:31Z",
         "content":"The professional party make sure you hold the best incentive rules upgraded and you will hunt down the newest no deposit also provides. By following these types of projects, you could potentially max… [+6484 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coinpedia.org",
         "title":"Bitcoin Recovers Finely, Yet the Bearish Clouds Haunt the BTC Price Rally!",
         "description":"A passionate cryptocurrency and blockchain author qualified to cover every event in the crypto space. Researching minute occurrences and bringing new insights lie within the prime focus of my task. Ever since the BTC price failed to hold at the higher resista…",
         "url":"https://biztoc.com/x/6edc033cea3a6210",
         "urlToImage":"https://c.biztoc.com/p/6edc033cea3a6210/s.webp",
         "publishedAt":"2024-05-04T07:44:06Z",
         "content":"A passionate cryptocurrency and blockchain author qualified to cover every event in the crypto space. Researching minute occurrences and bringing new insights lie within the prime focus of my task.Ev… [+226 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"thecryptobasic.com",
         "title":"XRP Biggest Coil Pattern Signals Potential 37,635% Explosion to $200",
         "description":"Analyst Javon Marks has proposed that XRP is nearing a converging point of its largest coil pattern, projecting a 37,635% bullish explosion to $200 amid market recovery. XRP has emerged as a beneficiary in the ongoing market recovery following the significant…",
         "url":"https://biztoc.com/x/9b9b18e905952358",
         "urlToImage":"https://c.biztoc.com/p/9b9b18e905952358/s.webp",
         "publishedAt":"2024-05-04T07:40:05Z",
         "content":"Analyst Javon Marks has proposed that XRP is nearing a converging point of its largest coil pattern, projecting a 37,635% bullish explosion to $200 amid market recovery.XRP has emerged as a beneficia… [+250 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"thecryptobasic.com",
         "title":"XRP Biggest Coil Pattern Signals Potential 37,635% Explosion to $200",
         "description":"Analyst Javon Marks has proposed that XRP is nearing a converging point of its largest coil pattern, projecting a 37,635% bullish explosion to $200 amid market recovery. XRP has emerged as a beneficiary in the ongoing market recovery following the significant…",
         "url":"https://biztoc.com/x/9b9b18e905952358",
         "urlToImage":"https://c.biztoc.com/p/9b9b18e905952358/s.webp",
         "publishedAt":"2024-05-04T07:40:05Z",
         "content":"Analyst Javon Marks has proposed that XRP is nearing a converging point of its largest coil pattern, projecting a 37,635% bullish explosion to $200 amid market recovery.XRP has emerged as a beneficia… [+250 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"coingape.com",
         "title":"3 Crypto Gainers of the Week Analysed",
         "description":"After a turbulent week that saw Bitcoin price dip below $60,000, the global crypto market has recovered, recording an increase of 5.11% to reach $2.34 trillion in 24 hours. This week, we witnessed several cryptocurrencies experience significant gains by over …",
         "url":"https://biztoc.com/x/472c664c38445acd",
         "urlToImage":"https://c.biztoc.com/p/472c664c38445acd/s.webp",
         "publishedAt":"2024-05-04T07:34:09Z",
         "content":"After a turbulent week that saw Bitcoin price dip below $60,000, the global crypto market has recovered, recording an increase of 5.11% to reach $2.34 trillion in 24 hours. This week, we witnessed se… [+302 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Bloguismo.com"
         },
         "author":"Anairas",
         "title":"Internet casino Incentives",
         "description":"Blogs Gambino Harbors Backup The newest Casinos Btc Handbag Target How Our very own Benefits Calculate The Local casino Recommendations You may also be able to visit the bricks and you may mortar counterpart so you can deposit a check. These electronic checks…",
         "url":"https://www.bloguismo.com/internet-casino-incentives-2/",
         "urlToImage":"https://g.twimg.com/Twitter_logo_blue.png",
         "publishedAt":"2024-05-04T07:31:46Z",
         "content":"You may also be able to visit the bricks and you may mortar counterpart so you can deposit a check. These electronic checks are safe, shorter, and you can commonly acknowledged. Clearly, finest eChec… [+6574 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"youtube.com",
         "title":"Bitcoin Market is about to go ABSURD! (10 Altcoins I Like)",
         "description":"Crypto is PRIMED for 2nd half of 2024 (10 Altcoins I Like) Best Crypto Exchange to Buy & Trade Bitcoin: ... #buytradebitcoin",
         "url":"https://biztoc.com/x/6d71830471772f48",
         "urlToImage":"https://c.biztoc.com/p/6d71830471772f48/s.webp",
         "publishedAt":"2024-05-04T07:16:12Z",
         "content":"Crypto is PRIMED for 2nd half of 2024 (10 Altcoins I Like) Best Crypto Exchange to Buy &amp; Trade Bitcoin: ...\r\n#buytradebitcoin\r\nThis story appeared on youtube.com, ."
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"youtube.com",
         "title":"When Could Bitcoin ‘Realistically’ Reach $1,000,000?",
         "description":"When could Bitcoin 'realistically' reach $1.000.000? GET MY FREE NEWSLETTER ...",
         "url":"https://biztoc.com/x/3d00d8a8a710f085",
         "urlToImage":"https://c.biztoc.com/p/3d00d8a8a710f085/s.webp",
         "publishedAt":"2024-05-04T07:16:11Z",
         "content":"When could Bitcoin 'realistically' reach $1.000.000? GET MY FREE NEWSLETTER ...\r\nThis story appeared on youtube.com, ."
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"dailyhodl.com",
         "title":"‘Inevitable’ That Bitcoin Surges Past $100,000 This Year, Says Quant Analyst PlanB",
         "description":"Closely followed quant analyst PlanB believes that Bitcoin (BTC) can reach six figures before the end of 2024. In a new strategy session, the on-chain analyst tells his 157,000 YouTube subscribers that based on prior history, Bitcoin’s price is likely to doub…",
         "url":"https://biztoc.com/x/b12c9f08ccff33e2",
         "urlToImage":"https://c.biztoc.com/p/b12c9f08ccff33e2/s.webp",
         "publishedAt":"2024-05-04T07:06:06Z",
         "content":"Closely followed quant analyst PlanB believes that Bitcoin (BTC) can reach six figures before the end of 2024.In a new strategy session, the on-chain analyst tells his 157,000 YouTube subscribers tha… [+227 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"The Daily Hodl"
         },
         "author":"Daily Hodl Staff",
         "title":"‘Inevitable’ That Bitcoin Surges Past $100,000 This Year, Says Quant Analyst PlanB – Here’s Why",
         "description":"Closely followed quant analyst PlanB believes that Bitcoin (BTC) can reach six figures before the end of 2024. In a new strategy session, the on-chain analyst tells his 157,000 YouTube subscribers that based on prior history, Bitcoin’s price is likely to doub…",
         "url":"https://dailyhodl.com/2024/05/04/inevitable-that-bitcoin-surges-past-100000-this-year-says-quant-analyst-planb-heres-why/",
         "urlToImage":"https://dailyhodl.com/wp-content/uploads/2023/11/Not-Be-Bullish-btc.jpg",
         "publishedAt":"2024-05-04T07:04:49Z",
         "content":"Closely followed quant analyst PlanB believes that Bitcoin (BTC) can reach six figures before the end of 2024.\r\nIn a new strategy session, the on-chain analyst tells his 157,000 YouTube subscribers t… [+2509 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Biztoc.com"
         },
         "author":"youtube.com",
         "title":"Tech Breakout In The Most Fundamentally Undervalued Stock",
         "description":"bitcoin #crypto #stocks Consider dropping a like if you enjoyed the video and say hello to Russ! To get access to Russ's Live ... #russlive",
         "url":"https://biztoc.com/x/27b8c226bc02444d",
         "urlToImage":"https://c.biztoc.com/p/27b8c226bc02444d/s.webp",
         "publishedAt":"2024-05-04T07:02:12Z",
         "content":"bitcoin #crypto #stocks Consider dropping a like if you enjoyed the video and say hello to Russ! To get access to Russ's Live ...\r\n#russlive\r\nThis story appeared on youtube.com, ."
      },
      {
         "source":{
            "id":null,
            "name":"Ambcrypto.com"
         },
         "author":"Himalay Patel",
         "title":"Ethereum NFTs on Blast – Should ETH holders worry now?",
         "description":"Blast NFT collections have surpassed Ethereum in terms of NFT trading volume. That's not the full picture though.",
         "url":"https://ambcrypto.com/ethereum-nfts-on-blast-should-eth-holders-worry-now/",
         "urlToImage":"https://ambcrypto.com/wp-content/uploads/2024/05/Ethereum-NFTs-Blast-1-1000x600.webp",
         "publishedAt":"2024-05-04T07:00:11Z",
         "content":"<ul><li>Blast overtook Ethereum in terms of NFT volume</li><li>While ETH’s price fell, network growth and velocity grew significantly on the charts</li></ul>Ethereum [ETH] has largely been dominant i… [+2568 chars]"
      },
      {
         "source":{
            "id":null,
            "name":"Pausaparafeminices.com"
         },
         "author":"Bruna Tavares",
         "title":"Better Online casino Web sites In britain",
         "description":"Articles Large Bet Gambling enterprises Indias Better Web based casinos To have 2024 Do i need to Get No-deposit Also offers On my Smart phone? Dining table Games Diversity Better Poland On-line casino App Organization All you need to do is check out the cash…",
         "url":"https://www.pausaparafeminices.com/ppf/better-online-casino-web-sites-in-britain/",
         "urlToImage":null,
         "publishedAt":"2024-05-04T06:59:15Z",
         "content":"All you need to do is check out the cashier part, discover the right cryptocurrency approach that you want to withdraw to help you and follow the instructions that appear for the display screen. Afte… [+5573 chars]"
      }
   ]
}
